app/services/authorize_api_request.rb

  def user
    # check if user is in the database
    # memoize user object
    @user ||= User.find(decoded_auth_token[:user_id]) if decoded_auth_token
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1