app/services/authenticate_user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'john@example.com' LIMIT 1
---
  def user
    user = User.find_by(email: email)