app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "description", "completed", "priority", "created_by", "created_at", "updated_at") VALUES ('Test API endpoint', 'Testing the create todo functionality', FALSE, 1, 1, '2025-08-06 09:44:46.962793', '2025-08-06 09:44:46.962793') RETURNING "id"
---
  def create
    @todo = current_user.todos.create!(todo_params)