app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ('Test User', 'test@example.com', '$2a$12$/4NO33kJB/TQcYM8o5uJPuWsJYsAsQ5KUAhjzUxmKR1JIy.7I3X5G', '2025-08-06 09:45:02.316203', '2025-08-06 09:45:02.316203') RETURNING "id"
---
  def create
    user = User.create!(user_params)